app/controllers/docs_controller.rb

SELECT "docs".* FROM "docs" WHERE "docs"."user_id" IS NULL
---
  def index
  	@docs = Doc.where(user_id: current_user)

INSERT INTO "docs" ("title", "content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "grow"], ["content", "Testing Doc\r\n"], ["created_at", "2017-08-16 18:21:49.590333"], ["updated_at", "2017-08-16 18:21:49.590333"], ["user_id", 1]]
---
  def create
  	@doc = current_user.docs.build(doc_params)

	if @doc.save

UPDATE "docs" SET "title" = ?, "updated_at" = ? WHERE "docs"."id" = ?  [["title", "broda"], ["updated_at", "2017-08-16 17:46:20.305437"], ["id", 4]]
---
  def update
	if @doc.update(doc_params)

DELETE FROM "docs" WHERE "docs"."id" = ?  [["id", 3]]
---
  def destroy
	@doc.destroy

SELECT  "docs".* FROM "docs" WHERE "docs"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
  def find_doc
 	@doc = Doc.find(params[:id])